Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleHollowProfile Class
 The IFC2X3_ParametricObject_RectangleHollowProfile class contains the rectangular and hollow profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_RectangleHollowProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_RectangleHollowProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_RectangleHollowProfile type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
InnerFilletRadius
 The inner fillet radius.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
OuterFilletRadius
 The outer fillet radius.
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WallThickness
 The wall thickness.
XDim
 The X dimension.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
YDim
 The Y dimension.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace